{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}}, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 28, 28, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 28, 28, 32]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 28, 28, 32]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 28, 28, 32]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 32]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 64]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 64]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 64]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "rate": 0.35, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "data_format": "channels_last"}, "build_config": {"input_shape": [null, 7, 7, 64]}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "build_config": {"input_shape": [null, 3136]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 256]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 137348305352512}, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "build_config": {"input_shape": [null, 256]}}], "build_input_shape": [null, 28, 28, 1]}, "build_config": {"input_shape": [null, 28, 28, 1]}, "compile_config": {"optimizer": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0001250000059371814, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "layers/batch_normalization/vars/0", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/2", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/3", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization_1/vars/0", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization_1/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization_1/vars/2", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization_1/vars/3", "shape": [32], "dtype": "float32"}, {"name": "layers/batch_normalization_2/vars/0", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_2/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_2/vars/2", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_2/vars/3", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_3/vars/0", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_3/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_3/vars/2", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_3/vars/3", "shape": [64], "dtype": "float32"}, {"name": "layers/batch_normalization_4/vars/0", "shape": [256], "dtype": "float32"}, {"name": "layers/batch_normalization_4/vars/1", "shape": [256], "dtype": "float32"}, {"name": "layers/batch_normalization_4/vars/2", "shape": [256], "dtype": "float32"}, {"name": "layers/batch_normalization_4/vars/3", "shape": [256], "dtype": "float32"}, {"name": "layers/conv2d/vars/0", "shape": [5, 5, 1, 32], "dtype": "float32"}, {"name": "layers/conv2d/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/conv2d_1/vars/0", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "layers/conv2d_1/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/conv2d_2/vars/0", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "layers/conv2d_2/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/conv2d_3/vars/0", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "layers/conv2d_3/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/dense/vars/0", "shape": [3136, 256], "dtype": "float32"}, {"name": "layers/dense/vars/1", "shape": [256], "dtype": "float32"}, {"name": "layers/dense_1/vars/0", "shape": [256, 10], "dtype": "float32"}, {"name": "layers/dense_1/vars/1", "shape": [10], "dtype": "float32"}, {"name": "optimizer/vars/0", "shape": [], "dtype": "int32"}, {"name": "optimizer/vars/1", "shape": [], "dtype": "float32"}, {"name": "optimizer/vars/10", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "optimizer/vars/11", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "optimizer/vars/12", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/13", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/14", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/15", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/16", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/17", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/18", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "optimizer/vars/19", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "optimizer/vars/2", "shape": [5, 5, 1, 32], "dtype": "float32"}, {"name": "optimizer/vars/20", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/21", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/22", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/23", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/24", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/25", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/26", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "optimizer/vars/27", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "optimizer/vars/28", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/29", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/3", "shape": [5, 5, 1, 32], "dtype": "float32"}, {"name": "optimizer/vars/30", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/31", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/32", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/33", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/34", "shape": [3136, 256], "dtype": "float32"}, {"name": "optimizer/vars/35", "shape": [3136, 256], "dtype": "float32"}, {"name": "optimizer/vars/36", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/37", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/38", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/39", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/4", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/40", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/41", "shape": [256], "dtype": "float32"}, {"name": "optimizer/vars/42", "shape": [256, 10], "dtype": "float32"}, {"name": "optimizer/vars/43", "shape": [256, 10], "dtype": "float32"}, {"name": "optimizer/vars/44", "shape": [10], "dtype": "float32"}, {"name": "optimizer/vars/45", "shape": [10], "dtype": "float32"}, {"name": "optimizer/vars/5", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/6", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/7", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/8", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/9", "shape": [32], "dtype": "float32"}]}]}